Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/air_travel/air_passenger_rights_in_the_eu.html.txt.tmx
Source language: en
Languages: ga

source: Air passenger rights in the European Union
ga: Cearta aerphaisinéirí san Aontas Eorpach

source: Under EEU and Irish law, you have certain rights when travelling by air with European airlines
ga: Tá cearta áirithe agat faoi dlí Éireannach agus Eorpach nuair atá tú ag taisteal ar eitleán le haerlínte Eorpacha

source: All European airlines, travel agents, tour operators and all other businesses involved in providing air transport services must observe your rights
ga: Ní foláir d'aerlínte Eorpacha, gníomhairí taistil, foirne turais agus gach gnó eile a bhfuil baint acu le seirbhísí aerthaistil a chur ar fáil, do chearta a chomhlíonadh

source: These rights relate to issues such as your right to receive accurate information about flights and reservations, obligations of travel agents, liability in the event of loss of baggage or accidents, compensation for overbooked flights, etc
ga: Baineann na cearta seo le ceisteanna mar do cheart chun eolas cruinn a fháil faoi eitiltí agus áirithintí, dualgais gníomhairí taistil, fiachas má chailltear bagáiste nó má tharlaíonn timpistí, cúiteamh i dtaobh eitiltí ró-lán, agus araile

source: Information about flights and reserving your ticket
ga: Eolas faoi eitiltí agus do thicéad a chur in áirithe

source: You have the right to neutral and accurate information when enquiring about or booking a flight through a travel agent
ga: Tá an ceart agat eolas cruinn agus neodrach a fháil agus tú ag fiosrú faoi, nó ag cur eitilt in áirithe le gníomhaire taistil

source: In other words, your travel agent must supply you with objective information (i.e., information that does not favour one airline over another or selective information about availability) when you enquire about flights and bookings from its computerised reservation system until you suggest a preference or give the travel agent an option
ga: Ní foláir do do ghníomhaire taistil eolas oibiachtúil a chur ar fáil duit ('sé sin eolas nach gcuireann aerlíne amháin chun tosaigh ar aerlíne eile, nó eolas roghnach maidir le hinfhaighteacht) nuair a chuireann tú ceist faoi eitiltí agus áirithintí óna chóras áirithinte ríomhairithe, go dtí go dtaispeánann tú cé acu is fearr leat, nó go dtugann tú do rogha don ghníomhaire taistil

source: This mean your travel agent is obliged to supply information to you about all the options available for a journey in the following order:
ga: Ciallaíonn sé seo go gcaithfidh do ghníomhaire taistil eolas a thabhairt duit faoi na roghanna uilig maidir le turas san ord thíos:

source: • Non-stop flights (i.e., flights that operate directly from one point to your destination)
ga: • Eitiltí gan stad (sé sin, eitiltí a théann díreach ó phointe amháin go dtí do cheann scríbe)

source: • Flights with intermediate stops (flights that operate with a stop-over and then proceed to destination)
ga: • Eitiltí le stadanna meánacha (Eitiltí a oibríonn le stad agus a théann ansin ar aghaidh go ceann scríbe)

source: • Connecting flights (i.e., a flight between two points where you must get on another flight to continue your journey)
ga: • Eitiltí cónasctha (sé sin, eitilt idir dhá phointe nuair a chaithfidh tú eitilt eile a fháil chun leanúint ar aghaidh le do thuras)

source: • All the fares available from various airlines
ga: • Na táillí go léir atá ar fáil ó na haerlínte éagsúla

source: Your travel agent must give you access to the information that is shown up by the computer system if you request this either by allowing you to see the screen or by printing out this information for you
ga: Ní foláir do do ghníomhaire taistil an t-eolas a thaispeánann an córas ríomhaire a chur ar fáil duit má tá sé uait trí an scaileán a thaispeáint duit, nó an t-eolas a phriontáil duit

source: In turn, airlines are obliged to provide all information to the computerised system so that this information is available to your travel agent and to you
ga: Bíonn ar na haerlínte, chomh maith, eolas iomlán a chur ar fáil don chóras ríomhairithe chun go mbeidh an t-eolas ar fáil do do ghníomhaire taistil agus duit féin

source: If you book your ticket with the airline, your travel agent must pass on all information available in the computer system about:
ga: Má chuireann tú do thicéad in áirithe leis an aerlíne, ní foláir do do ghníomhaire taistil an t-eolas uilig atá ar fáil ón gcóras ríomhairithe a chur ar aghaidh faoi:

source: • The airline that will provide the service (if this is different from the airline mentioned on your ticket)
ga: • An aerlíne a chuirfidh an tseirbhís ar fáil (má tá sé difriúil ón aerlíne luaite ar do thicéad)

source: • Changes of aircraft that may occur during your journey
ga: • Aistriú eitleáin a d'fhéadfadh tarlú i rith do thurais

source: • Stops en route during your journey
ga: • Stadanna en route i rith do thurais

source: • Transfers between airports that may occur during your journey
ga: • Aistriú idir aerphoirt a d'fhéadfadh tarlú i rith do thurais

source: If you have a valid ticket and you have confirmed your reservation and presented yourself at check-in at the airport within the time specified by the airline but you are not allowed to board the aircraft because the flight is overbooked, you are entitled to compensation under EU law
ga: Má tá ticéad bailí agat, má tá d'áirithint dearbhaithe agus má tá tú ag an ionad seiceála isteach ag an aerphort taobh istigh den am atá leagtha síos ag an aerlíne agus fós muna dtugtar cead duit an t-eitleán a bhordáil mar gheall go bhfuil an eitilt ró-lán, tá ceart cúitimh agat faoi dhlí Eorpach

source: Air travel as part of a package holiday
ga: Aerthaisteal mar chuid de shaoire láneagraithe

source: If you are travelling by air as part of a package tour or holiday purchased in Europe, you must receive clear, accurate and precise information from the organiser about your trip
ga: Má tá tú ag taisteal san aer mar chuid de thuras láneagraithe nó saoire ceannaithe san Eorap, ní foláir duit eolas soléir, ceart agus cruinn a fháil ón eagraí faoi do thuras

source: Read more about your rights including information about brochures, transfers, price stipulations and complaints
ga: Léigh tuilleadh faoi do chearta, eolas faoi bróisiúir, aistrithe, táillí agus gearáin

source: Air transport for people with reduced mobility
ga: Aeriompar do dhaoine ar lú a gcumas gluaiseachta

source: Airlines and tour operators may not refuse to carry passengers, or to take bookings, on the basis of reduced mobility
ga: Ní ceadmhach d’aerlínte ná do thionscnóirí turasóireachta diúltú paisinéirí a iompar ná glacadh lena gcuid áirithintí ar an ábhar gur lú a gcumas gluaiseachta

source: This applies only to flights from airports in the EU
ga: Ní bhaineann sé seo ach le heitiltí as aerfoirt an AE

source: Regulation (EC) No 1107/2006 provides that a reservation or boarding can only be refused for justified safety reasons or if the boarding or transport of a person with a disability or reduced mobility is physically impossible, due to the size of the aircraft or its doors
ga: Forálann Rialachán (CE) Uimh. 1107/2006 nach féidir duine a eiteach faoi áirithint ná faoi theacht ar bord ach ar ábhair bhailí shábháilteachta nó murar féidir go fisiciúil an duine atá faoi mhíchumas nó ar lú a chumas gluaiseachta a thabhairt ar bord nó a iompar mar gheall ar mhéad an eitleáin nó ar mhéad na ndoras atá air

source: If the person is refused a reservation, an acceptable alternative must be offered
ga: Má diúltaítear duine faoi áirithint, caithfear rogha inghlactha eile a thairiscint dó

source: If boarding is refused, the person must be offered reimbursement or re-routing
ga: Má diúltaítear duine faoi theacht ar bord, caithfear aisíoc nó athchúrsa a thairiscint dó

source: Airport authorities are obliged to provide assistance without extra cost to the person concerned but it may levy a charge on all passengers
ga: Ní mór d’údaráis an aerfoirt cúnamh a chur ar fáil gan aon chostas breise a ghearradh ar an duine atá i gceist, ach os a chionn sin féadfaidh siad tobhach a ghearradh ar na paisinéirí uile

source: Other provisions under this Regulation include:
ga: I measc na bhforálacha eile de bhun an Rialacháin seo tá:

source: • The airport authority is responsible for ensuring that the intending passenger receives the necessary assistance from designated points of arrival at the airport to the point of boarding the aircraft
ga: • Tá dualgas ar údarás an aerfoirt deimhin a dhéanamh de go bhfaighidh an t-ábhar paisinéara an cúnamh a theastaíonn uaidh as pointí ainmnithe teachta chun an aerfoirt nó go rachaidh sé ar bord an eitleáin

source: There is a similar provision for passengers who are landing at an EU airport
ga: Tá a shamhail d’fhoráil i bhfeidhm maidir le paisinéirí atá ag tuirlingt in aerfort san AE

source: • On flights from EU airports, airlines are obliged to provide certain services, such as the carrying of wheelchairs or guide dogs, free of charge
ga: • I gcás eitiltí as aerfoirt an AE, tá de cheangal ar na haerlínte seirbhísí áirithe a chur ar fáil, mar shampla cathaoireacha rothaí nó madraí treorach a iompar, é seo saor in aisce

source: • Both airport authorities and airlines are obliged to provide training to their staff so that those providing direct assistance to people with disabilities and reduced mobility should know how to meet their needs
ga: • Tá de cheangal ar údaráis an aerfoirt agus ar na haerlínte oiliúint a chur ar fáil dá mbaill foirne sa chaoi is gurb eol dóibh siúd a bhíonn ag plé go díreach le daoine atá faoi mhíchumas nó ar lú a gcumas gluaiseachta cé mar ba cheart riar ar a gcuid riachtanas

source: All staff working at the airport should be provided with disability equality and awareness training
ga: Níor mhór oiliúint faoi chearta comhionannais lucht míchumais a chur ar fáil d’fhoireann an aerfoirt uile le mbeidís feasach

source: More information is available on the Commission for Aviation Regulation's flightrights.ie website
ga: Tá tuilleadh eolais ar fáil ar láithreán gréasáin an Choimisiúin um Rialáil Eitlíochta flightrights.ie

source: Passengers reserving air tickets in Europe have the right to know about any personal details held or stored about them on computer reservation systems, what this information is to be used for and who is in control of this information
ga: Tá an ceart ag páisnéirí atá ag cur ticéid aeir in áirithe san Eorap eolas a bheith acu faoi sonraí pearsanta ar bith atá coinnithe nó stóráilte futhu ar chórais áirithinte ríomhairithe, cad chuige a úsáidfear an t-eolas, agus cé atá i gceannas ar an eolas

source: When your travel agent is making a reservation on your behalf using a computer system, he or she must tell you why the information is necessary, how long this information is being stored for and the name of the computer operator and how to contact this organisation
ga: Nuair atá gníomhaire taistil ag déanamh áirithint ar do shon ar chóras ríomhaire, ní foláir dó/di a insint duit cén fáth a bhfuil an t-eolas riachtanach, cé chomh fada agus a bhéas sé coinnithe, ainm an chomlachta ríomhaire agus conas a d'fhéadfá dul i dteagmháil leo

source: Anyone who requests this information must be given free access to information that is being stored about him or her on the computer reservation system
ga: Ní foláir eolas a thabhairt do dhuine ar bith a dhéanann iarratas air faoin eolas atá stóráilte faoi/fuithi ar an gcóras áirithinte ríomhairithe

source: The Data Protection Commission in Ireland is in place to uphold your rights to information held about you on computer
ga: Tá an Coimisiún Cosanta Sonraí in Éirinn ann chun do cheart chun eolas a bheith agat ar sonraí coinnithe fút ar ríomhaire a chaomhnú

source: Advanced Passenger Information Requirements
ga: Faisnéis a Thabhairt faoi Phaisinéirí Roimh Ré

source: Under a law implemented by the US Bureau of Customs and Border Protection airlines carrying passengers to the US are obliged to supply information about passengers in advance of travel
ga: Tá dlí curtha i bhfeidhm ag “Bureau of Customs and Border Protection” na Stát Aontaithe. Dá dheasca seo tá de cheangal ar na haerlínte atá ag brath paisinéirí a iompar go dtí na Stáit Aontaithe faisnéis a chur ar fáil fúthu roimh ré

source: Here are examples of the type of information an airline can/may request from you:
ga: Seo samplaí den chineál faisnéise a fhéadfaidh nó a bhfuil cead ag an aerlíne a iarraidh ort:

source: • Your first name (as on passport)
ga: • Do chéad ainm (mar atá ar do phas)

source: • Your family name (as on passport)
ga: • Do shloinne (mar atá ar do phas)

source: • Your date of birth (day/month/year) format
ga: • Do dháta breithe san fhormáid (lá/mí/bliain)

source: • Country where your passport was issued
ga: • An tír inar eisíodh do phas

source: • Expiry date of your passport (day/month/year) format
ga: • Dáta éaga do phas san fhormáid (lá/mí/bliain)

source: • Address while you are in the USA (including the ZIP code)
ga: • Do sheoladh le linn duit a bheith i Stáit Aontaithe Mheiriceá (an cód poist san áireamh)

source: Please remember, you are obliged to supply this information to your airline
ga: Tabhair do d’aire go bhfuil iallach ort an fhaisnéis seo a chur ar fáil don aerlíne agat

source: If you have any concerns regarding the supply of this information, contact your airline directly
ga: Má tá imní ar bith ort faoi sholáthar na faisnéise seo, téigh i dteagmháil go díreach le d’aerlíne

source: The Data Protection Commission of Ireland has stated that airlines are obliged by law to provide this information to the US authorities and passengers will be notified of this requirement when they book flights
ga: Tá ráite ag Coimisiún Cosanta Sonraí na hÉireann go bhfuil dualgas dlíthiúil ar na haerlínte an fhaisnéis seo a chur ar fáil d’údaráis na Stát Aontaithe agus cuirfear na paisinéirí ar an eolas faoin riachtanas seo nuair a chuirfidh siad a n-eitilt in áirithe

source: Further information regarding the US Advance Passenger Information System (APIS) is available here
ga: Féadfar tuilleadh eolais faoin gCóras Réamh-Fhaisnéise faoi Phaisinéirí a fháil anseo

source: Liability in the event of an accident
ga: Fiachas i gcás timpiste

source: There is no financial limit on the liability of an EU airline for damages sustained by you in the event of death, wounding or any other bodily injury
ga: Níl aon teorainn airgeadais maidir le dliteanas de chuid aerlíne an AE i leith damáistí a bhain tú i gcás báis, créachtú nó aon díobhála coirp eile

source: For damages up to 113,100 SDRs, the airline cannot contest claims for compensation
ga: Le haghaidh damáistí suas go dtí 113,100 SDR, ní féidir leis an aerlíne comórtas éilimh ar chúiteamh

source: Find out more about an airline's liability following the death or injury of a passenger, or damage or loss of luggage in our document on airline liability
ga: Faigh amach tuilleadh faoi aerlíne dliteanas tar éis báis nó díobhála do phaisinéir, nó damáiste nó caillteanas bagáiste inár ndoiciméad ar dhliteanas aerlíne

source: Enforcing your air passenger rights
ga: Ag baint amach do chearta paisinéara

source: The above rights have been set down either directly in EU law or in Irish law that has been introduced to bring EU legislation into effect
ga: Tá na cearta thuas leagtha síos i ndlí de chuid an AE nó i ndlí Éireannach a tugadh isteach chun reachtaíocht an A.E. a chur i bhfeidhm

source: Airlines, travel agents, tour operators and all other businesses involved in providing air transport services must observe them
ga: Ní foláir d'aerlínte, gníomhairí taistil, foirne turais agus chuile ghnó eile a bhfuil baint acu le seirbhísí aerthaistil a chur ar fáil, iad a chomhlíonadh

source: You should be aware of your rights and be prepared to defend them
ga: Ba cheart duit a bheith eolach ar do chearta agus a bheith sásta iad a chosaint

source: If you feel your rights have not been respected and you have not received the level of treatment or compensation to which you are entitled, you should contact the the Aviation Regulation Division at the Department of Transport, Tourism and Sport or the Competition and Consumer Protection Commission and inform them about it
ga: Má cheapann tú nach raibh meas ar do chearta, agus nach bhfuair tú an caighdeán seirbhíse nó cúitimh atá ag dul duit, ba cheart duit dul i dteagmháil le Rannóg Rialacháin Eitleoireachta na Roinne Iompair, nó oifig an Stiurthóra um Ghnóthaí Tomhaltóirí agus iad a chur ar an eolas faoi

source: You can also contact the Directorate-General for Transport and Energy of the European Commission
ga: D'fhéadfá chomh maith dul i dteagmháil le hArd-Stiúrthóireacht Iompair agus Fuinnimh Choimisiún na hEorpa
